# Кортеж для унікальних, незмінних категорій[cite: 1]
CATEGORIES = ("Електроніка", "Побутова техніка", "Аксесуари")

# Список словників із даними про товари[cite: 1]
products = [
    {"code": 101, "name": "Ноутбук", "category": "Електроніка", "price": 25000.0, "quantity": 10},
    {"code": 102, "name": "Мишка", "category": "Електроніка", "price": 800.0, "quantity": 50},
    {"code": 103, "name": "Мікрохвильова піч", "category": "Побутова техніка", "price": 4500.0, "quantity": 5},
    {"code": 104, "name": "Навушники", "category": "Аксесуари", "price": 1500.0, "quantity": 2},
    {"code": 105, "name": "Холодильник", "category": "Побутова техніка", "price": 18000.0, "quantity": 3},
]